[
  "I was doing great on the rifle range until I was positioned 200 yards away from the target. I didn't hit it once - all my shots just scattered the dirt next to it. I thought I'd failed, but the range sergeant assured me that I'd qualified, saying,\n\n\"You would have suffocated anyone with all the dust you kicked up.\"",

  "Two losers, Tom and Al, are in a bar sipping beer when a man orders 10 shots of booze and shouts, \"I got $500 that says no one here can drink all of these in one minute.\" Tom says, \"My buddy will take the bet!\" and pushes Al in front of the shots.\n\nAl stares at all the liquor, then runs out the door. The man laughs. \"I knew you lightweights couldn't do it.\" Five minutes later, Al returns and slams down all 10 shots in 50 seconds. He grabs the money and sits back behind his beer.\n\n\"Where'd you go?\" asks Tom. \"I wasn't sure I could drink 12 shots in a minute, so I went to the bar next door and tried it first.\"",

  "What should you say to comfort a ruffled grammar fanatic?\n\nThere, their, they're.",

  "When I was a kid, my teacher looked at my way and said, \"Name two pronouns.\"\n\nI said, \"Who, me?\"",

  "On her first day of rounds at an Australian hospital, a visiting American nurse meets an old man packing up. \"I'm going home to die,\" he says. She quickly checks his chart. \"Not according to your chart.\"\n\n\"I'm going home to die,\" he insists.\n\"Who told you that?\"\n\"My doctor.\"\n\"Well it's not true. You are not going home to die!\"\n\"Yes, I am! I was supposed to go home yester-die, but instead, I'm going home to-die!\"",

  "My friends tell me that cooking is easy. But its not easier than not cooking.",

  "The world's worst actor is performing Hamlet. He's so awful that during the \"To be or not to be\" speech, the audience boos and throws things. Finally, the actor has enough. He steps to the edge of the stage and says,\n\n\"Look folks, I didn't write this junk.\"",

  "I knew I was going bald when I realized it was taking longer and longer to wash my face.",

  "I asked my dad, a Navy guy, how far from land his ship was while on the ocean.\n\n\"We were always just a few miles from the land,\" he said. \"Straight down.\""
]
